package addExtraTasks;

public class Task_6 {
    public static void main(String[] args) {
        System.out.println(isEven(8));

    }
    public static boolean isEven(int number) {
        return number % 2 == 0;
    }

}

//Напишите тесты для проверки метода isEven(int number).
//Упростите работу метода, код внутри может быть написан в одну строку.